In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd

In [ ]:
filename = '/content/drive/MyDrive/Coding Dojo/Raw Data/CalIt2.csv'
df = pd.read_csv(filename, header = None)
df.info

<bound method DataFrame.info of        0         1         2  3
0      7  07/24/05  00:00:00  0
1      9  07/24/05  00:00:00  0
2      7  07/24/05  00:30:00  1
3      9  07/24/05  00:30:00  0
4      7  07/24/05  01:00:00  0
...   ..       ...       ... ..
10075  9  11/05/05  22:30:00  0
10076  7  11/05/05  23:00:00  0
10077  9  11/05/05  23:00:00  0
10078  7  11/05/05  23:30:00  1
10079  9  11/05/05  23:30:00  0

[10080 rows x 4 columns]>

In [ ]:
#Rename Columns
df = df.rename(columns = { 0 :'Flow_ID',
                          1 :'Date',
                          2 :'Time',
                          3 :'Count'})
df.head()

   Flow_ID      Date      Time  Count
0        7  07/24/05  00:00:00      0
1        9  07/24/05  00:00:00      0
2        7  07/24/05  00:30:00      1
3        9  07/24/05  00:30:00      0
4        7  07/24/05  01:00:00      0

In [ ]:
# select all data for the date 07/24/2005
date_filter = df['Date'] == '07/24/05'
df.loc[date_filter, :].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 96 entries, 0 to 95
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Flow_ID  96 non-null     int64
 1   Date     96 non-null     object
 2   Time     96 non-null     object
 3   Count    96 non-null     int64
dtypes: int64(2), object(2)
memory usage: 3.8+ KB

In [ ]:
# select all data for flow id = 7
flow_filter = df['Flow_ID'] == 7
df.loc[flow_filter, :].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5040 entries, 0 to 10078
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Flow_ID  5040 non-null   int64
 1   Date     5040 non-null   object
 2   Time     5040 non-null   object
 3   Count    5040 non-null   int64
dtypes: int64(2), object(2)
memory usage: 196.9+ KB

In [ ]:
# combine them
combined_df = df.loc[date_filter & flow_filter, :]
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48 entries, 0 to 94
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Flow_ID  48 non-null     int64
 1   Date     48 non-null     object
 2   Time     48 non-null     object
 3   Count    48 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.9+ KB

In [ ]:
# from selected data, sort the result on count in descending order
# then output the top 10 rows. Assign the output to a variable named top
top10 = combined_df.sort_values('Count', ascending = False).head(10)
top10

    Flow_ID      Date      Time  Count
72        7  07/24/05  18:00:00      4
84        7  07/24/05  21:00:00      3
76        7  07/24/05  19:00:00      2
92        7  07/24/05  23:00:00      2
30        7  07/24/05  07:30:00      2
10        7  07/24/05  02:30:00      2
86        7  07/24/05  21:30:00      2
70        7  07/24/05  17:30:00      2
68        7  07/24/05  17:00:00      1
74        7  07/24/05  18:30:00      1

In [ ]:
# for top10, use Pandas Apply function to subtract lowest value of the 10 from
# all of them and then output the average value of the resulting counts
sub_count = top10['Count'] - min(top10['Count'])
sub_count.mean()

1.1

In [ ]:
# for top10, use Pandas Apply function to subtract lowest value of the 10 from
# all of them and then output the average value of the resulting counts
def count_mean(x):
  return x - min(top10['Count'])
top10['Count'] = top10['Count'].apply(count_mean)
top10['Count'].mean()

1.1

In [ ]:
# select data in the month of August 2005 having flow id = 7
month_filter = (df['Date'] >= '08/01/05') & (df['Date'] <= '08/31/05')
#flow_filter is defined from earlier
group_df = df.loc[month_filter & flow_filter,:]
group_df.head()

     Flow_ID      Date      Time  Count
768        7  08/01/05  00:00:00      1
770        7  08/01/05  00:30:00      0
772        7  08/01/05  01:00:00      0
774        7  08/01/05  01:30:00      0
776        7  08/01/05  02:00:00      0

In [ ]:
#group the data based on date and get the max count per date
group_df.groupby(['Date'])[['Count']].max()

          Count
Date
08/01/05     18
08/02/05     16
08/03/05     26
08/04/05     40
08/05/05     17
08/06/05      8
08/07/05      3
08/08/05     16
08/09/05     19
08/10/05     25
08/11/05     16
08/12/05     21
08/13/05      5
08/14/05      3
08/15/05     17
08/16/05     24
08/17/05     22
08/18/05     39
08/19/05     23
08/20/05      3
08/21/05      4
08/22/05     23
08/23/05     25
08/24/05     17
08/25/05     24
08/26/05     22
08/27/05      3
08/28/05      7
08/29/05     15
08/30/05     47
08/31/05     19